Revit 2026 API

# DWFImageFormat Enumeration

---

An enumerated type listing possible image format for DWF Export.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DWFImageFormat
```
```vb
Public Enumeration DWFImageFormat
```
```cpp
public enum class DWFImageFormat
```
```fsharp
type DWFImageFormat
```

| Member name | Value | Description |
| --- | --- | --- |
| Lossless | 0 |  |
| Lossy | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace